# CannotAutoUpdate Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DocumentFailures..::..CannotAutoUpdate Property
BuiltInFailures..::..DocumentFailures Class See Also
---
Coordination Monitor can't update element
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotAutoUpdate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotAutoUpdate As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotAutoUpdate {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DocumentFailures Class
Autodesk.Revit.DB Namespace